//task #1
var Tc=+(prompt('Введите температуру в градусах Цельсия:'));
alert('Температура по Фаренгейту: ' + (9/5*Tc+32));

//task #2
var name='Василий', admin;
admin=name;
console.log('admin='+admin+'; name='+name);

//task #3
console.log(1000+'108');

//task #4
var p='<p>';
p+='"async" - атрибут предназначен для ассинхронной загрузки скрипта, в независимости от статуса загрузки страницы. Скрипты выполняются не по порядку, а по мере заугрузки.<br>"defer" - браузер гарантирует, что относительный порядок скриптов с defer будет сохранён. Скрипт с defer сработает, когда весь HTML-документ будет обработан браузером.';
p+='</p>';
document.write(p);

//task *
var a=10, b=20;
b=a+b;
a=b-a;
b=b-a;
console.log('a='+a+'; b='+b);