var works = {
    a00:'Выберите верный вариант ответа на вопрос.\n' +
    'Сколько щупалец у осьминога?\n',
    a0: 2,
    a1: 'a - 1\n',
    a2: 'b - 8\n',
    b00: 'Как звали Сиверуса в Гарри Поттере?',
    b0: 2,
    b1: 'a - Снейп\n',
    b2: 'b - Снэгг\n',
    c00: 'Почему так жесток ...?\n',
    c0: 2,
    c1: 'a - ветер\n',
    c2: 'b - снег\n',
    d00: 'Здесь пишем текст повествования.\n' +
    'Потом пишем несколько действий, например, два\n',
    d0: 2, // кол-во ответов
    d1: '1 - 1-й ответ\n',
    d2: '2 - 2-й ответ\n',
};

